In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
""" 8.3 Reshaping and Pivoting"""

' 8.3 Reshaping and Pivoting'

In [4]:
"""    Reshaping avec index hierarchique"""

'    Reshaping avec index hierarchique'

In [5]:
data =pd.DataFrame(np.arange(6).reshape((2,3)),
                   index=pd.Index(['Ohio','Colorado'],name='state'),
                   columns=pd.Index(['one','two','three'],
                   name='number'))

In [6]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [7]:
#pivoter les colonnes en lignes
result = data.stack()

In [8]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [9]:
#les reformer en dataframe
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [10]:
#faire un stack/unstack par niveau
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [11]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [12]:
""" Pivoting Long to Wide Format"""

' Pivoting Long to Wide Format'